app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "list_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "AN"], ["list_id", 1], ["user_id", 2], ["created_at", "2022-08-04 12:53:29.255408"], ["updated_at", "2022-08-04 12:53:29.255408"]]
---
        task = Task.create!(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "user_id" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["name", "testwew"], ["user_id", 1], ["updated_at", "2022-08-08 03:12:05.299708"], ["id", 1]]
---
        task = Task.find(params[:id])
        task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
        task = Task.find_by(id: params[:id])
        task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        task = Task.find_by(id: params[:id])