app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
      if session[:user_id]
        user = User.find(session[:user_id])

INSERT INTO "users" ("name", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "rrre"], ["password_digest", "[FILTERED]"], ["email", "eeew@mail.com"], ["created_at", "2022-08-08 01:57:14.235118"], ["updated_at", "2022-08-08 01:57:14.235118"]]
---
    def create
       user = User.new(user_params)
        if user.valid? && params[:password] == params[:password_confirmation]
            user.save!